app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def index
    @users = User.find(:all)

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def load_user
    @user = User.find(params[:id])