app/controllers/vendors_controller.rb

SELECT * FROM `vendors`
---
  def index
    @vendors = Vendor.all